; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_3 ?v6 - type_1 ?v3 - type_3)
 	      (pred_2 ?v7 - object ?v3 - type_3)
	      (pred_4 ?v6 - type_1 ?v8 - type_2)
	      (pred_1 ?v6 - type_1 ?v7 - object ?v8 - type_2))

   (:action op_2
       :parameters  (?v6 - type_1 ?v5 ?v1 - type_3)
       :precondition (and  (pred_3 ?v6 ?v5))
       :effect (and  (pred_3 ?v6 ?v1)
		     (not (pred_3 ?v6 ?v5))))

   (:action op_1
       :parameters (?v6 - type_1 ?v2 - object ?v4 - type_3 ?v8 - type_2)
       :precondition  (and  (pred_2 ?v2 ?v4) (pred_3 ?v6 ?v4) (pred_4 ?v6 ?v8))
       :effect (and (pred_1 ?v6 ?v2 ?v8)
		    (not (pred_2 ?v2 ?v4)) 
		    (not (pred_4 ?v6 ?v8))))

   (:action op_3
       :parameters (?v6 - type_1 ?v2 - object ?v4 - type_3 ?v8 - type_2)
       :precondition  (and  (pred_1 ?v6 ?v2 ?v8) (pred_3 ?v6 ?v4))
       :effect (and (pred_2 ?v2 ?v4)
		    (pred_4 ?v6 ?v8)
		    (not (pred_1 ?v6 ?v2 ?v8)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_05 obj_07 - type_1
obj_12 obj_02 obj_08 obj_03 - type_2
obj_11 obj_09 obj_10 - type_3
obj_06 obj_04 obj_01 - object)
(:init
(pred_3 obj_05 obj_10)
(pred_4 obj_05 obj_12)
(pred_4 obj_05 obj_02)
(pred_3 obj_07 obj_10)
(pred_4 obj_07 obj_08)
(pred_4 obj_07 obj_03)
(pred_2 obj_06 obj_09)
(pred_2 obj_04 obj_09)
(pred_2 obj_01 obj_09)
)
(:goal
(and
(pred_2 obj_06 obj_11)
(pred_2 obj_04 obj_11)
(pred_2 obj_01 obj_10)
)
)

(:constraints
  (always (not (pred_3 obj_05 obj_09)))
)
)

; plan
1. (op_2 obj_05 obj_10 obj_11)
   deleted: (pred_3 obj_05 obj_10)
   added: (pred_3 obj_05 obj_11)
   goals met: 0 of 3
2. (op_2 obj_07 obj_10 obj_09)
   deleted: (pred_3 obj_07 obj_10)
   added: (pred_3 obj_07 obj_09)
   goals met: 0 of 3
3. (op_1 obj_07 obj_01 obj_09 obj_03)
   deleted: (pred_2 obj_01 obj_09) (pred_4 obj_07 obj_03)
   added: (pred_1 obj_07 obj_01 obj_03)
   goals met: 0 of 3
4. (op_2 obj_07 obj_09 obj_10)
   deleted: (pred_3 obj_07 obj_09)
   added: (pred_3 obj_07 obj_10)
   goals met: 0 of 3
5. (op_3 obj_07 obj_01 obj_10 obj_03)
   deleted: (pred_1 obj_07 obj_01 obj_03)
   added: (pred_2 obj_01 obj_10) (pred_4 obj_07 obj_03)
   goals met: 1 of 3
6. (op_2 obj_07 obj_10 obj_09)
   deleted: (pred_3 obj_07 obj_10)
   added: (pred_3 obj_07 obj_09)
   goals met: 1 of 3
7. (op_1 obj_07 obj_06 obj_09 obj_03)
   deleted: (pred_2 obj_06 obj_09) (pred_4 obj_07 obj_03)
   added: (pred_1 obj_07 obj_06 obj_03)
   goals met: 1 of 3
8. (op_1 obj_07 obj_04 obj_09 obj_08)
   deleted: (pred_2 obj_04 obj_09) (pred_4 obj_07 obj_08)
   added: (pred_1 obj_07 obj_04 obj_08)
   goals met: 1 of 3
9. (op_2 obj_07 obj_09 obj_11)
   deleted: (pred_3 obj_07 obj_09)
   added: (pred_3 obj_07 obj_11)
   goals met: 1 of 3
10. (op_3 obj_07 obj_04 obj_11 obj_08)
   deleted: (pred_1 obj_07 obj_04 obj_08)
   added: (pred_2 obj_04 obj_11) (pred_4 obj_07 obj_08)
   goals met: 2 of 3
11. (op_3 obj_07 obj_06 obj_11 obj_03)
   deleted: (pred_1 obj_07 obj_06 obj_03)
   added: (pred_2 obj_06 obj_11) (pred_4 obj_07 obj_03)
   goals met: 3 of 3
